Revit 2026 API
ModelPathUtils Methods
The ModelPathUtils type exposes the following members.
Methods
Name | Description
ConvertCloudGUIDsToCloudPath |  Converts a pair of cloud project and model GUIDs to a valid cloud path.
ConvertModelPathToUserVisiblePath |  Gets a string version of the path of a given ModelPath.
ConvertUserVisiblePathToModelPath |  Converts a user-visible path (string) to a ModelPath.
IsValidUserVisibleFullServerPath |  Determines whether the given string represents a valid server path.
Top
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace